In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
         'person':['sam','charlie','amy','vanessa','carl','sarah'],
        'sales' : [200,122,340,124,243,350]}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

  company   person  sales
0    GOOG      sam    200
1    GOOG  charlie    122
2    MSFT      amy    340
3    MSFT  vanessa    124
4      FB     carl    243
5      FB    sarah    350

In [7]:
bycomp = df.groupby('company')

In [8]:
bycomp

In [9]:
bycomp.mean()

         sales
company
FB       296.5
GOOG     161.0
MSFT     232.0

In [10]:
bycomp.sum()

         sales
company
FB         593
GOOG       322
MSFT       464

In [11]:
bycomp.std()

              sales
company
FB        75.660426
GOOG      55.154329
MSFT     152.735065

In [14]:
bycomp.describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   296.500000  161.000000  232.000000
      std     75.660426   55.154329  152.735065
      min    243.000000  122.000000  124.000000
      25%    269.750000  141.500000  178.000000
      50%    296.500000  161.000000  232.000000
      75%    323.250000  180.500000  286.000000
      max    350.000000  200.000000  340.000000

In [15]:
bycomp.describe().transpose()['FB']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [17]:
bycomp.sum().loc['FB']

sales    593
Name: FB, dtype: int64